Revit 2027 API
FabricationConfiguration.GetFabricationConfiguration Method
 Gets the fabrication configuration element in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricationConfiguration GetFabricationConfiguration(
	Document document
)
Public Shared Function GetFabricationConfiguration (
	document As Document
) As FabricationConfiguration
public:
static FabricationConfiguration^ GetFabricationConfiguration(
	Document^ document
)
static member GetFabricationConfiguration :
        document : Document -> FabricationConfiguration
Parameters
document Document
 The document.
Return Value
FabricationConfiguration
 The fabrication configuration element in the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace